Garfield-1314/Cat-Food-Machine/src/sdkconfig.defaults
# Set target chip
CONFIG_IDF_TARGET="esp32s3"

# Cat board: module is N16R8 (has 8MB octal PSRAM) BUT the board routes
# GPIO35/36/37 (octal PSRAM data lines D2/D3/D4) to the ST7789 LCD (CLK/MOSI/CS).
# Enabling PSRAM causes MSPI bus contention -> boot hang -> TG1WDT reset loop.
# Keep PSRAM DISABLED on this board. Only enable on a board with free PSRAM pins:
# CONFIG_SPIRAM=y
# CONFIG_SPIRAM_MODE_OCT=y
# CONFIG_SPIRAM is not set

# N16 module: write the detected 16 MB flash size into the image header.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# OV2640 camera
CONFIG_CAMERA_OV2640=y
# Built-in JPEG base mode; application code applies the 240x240 square crop.
CONFIG_CAMERA_OV2640_DVP_JPEG_320X240_50FPS=y

# Use large single-app partition (2MB factory partition)
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# Console over the built-in USB-Serial-JTAG (chip ROM virtual serial port).
# Works from power-on / bootloader, stays connected across reboots, no USB-TTL needed.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Keep the general Wi-Fi hot path in IRAM for MJPEG transmit performance, but
# move the optional RX fast path to flash to reclaim internal RAM.
CONFIG_ESP_WIFI_IRAM_OPT=y
# CONFIG_ESP_WIFI_RX_IRAM_OPT is not set
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=24

# IPv4-only WPA2 station profile. The application never creates a SoftAP and
# does not use WPA3, OWE, enterprise authentication, or a DHCP server.
# CONFIG_ESP_WIFI_SOFTAP_SUPPORT is not set
# CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT is not set
# CONFIG_ESP_WIFI_ENABLE_WPA3_SAE is not set
# CONFIG_ESP_WIFI_ENABLE_SAE_PK is not set
# CONFIG_ESP_WIFI_ENABLE_SAE_H2E is not set
# CONFIG_ESP_WIFI_SOFTAP_SAE_SUPPORT is not set
# CONFIG_ESP_WIFI_ENABLE_WPA3_OWE_STA is not set
# CONFIG_ESP_WIFI_GMAC_SUPPORT is not set
# CONFIG_LWIP_DHCPS is not set
# CONFIG_LWIP_IPV6 is not set

# LVGL Configuration
CONFIG_LV_COLOR_16_SWAP=y

CONFIG_LV_MEM_SIZE_KILOBYTES=20
# CONFIG_LV_BUILD_EXAMPLES is not set

CONFIG_LV_FONT_MONTSERRAT_10=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_48=y

# All debug output goes to the USB-Serial-JTAG virtual serial port
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Disable Task WDT
# CONFIG_ESP_TASK_WDT_EN is not set
# CONFIG_ESP_TASK_WDT_INIT is not set
# CONFIG_TASK_WDT is not set

# SNTP (Network Time Sync) Configuration
CONFIG_LWIP_SNTP_MAX_SERVERS=3
CONFIG_LWIP_DHCP_GET_NTP_SRV=y
CONFIG_LWIP_DHCP_MAX_NTP_SERVERS=1
